mushBrainDave/esp32-p4-imx-camera/examples/imx708_snapshot/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM — frame buffers + the BMP row work live off SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# 200 MHz PSRAM is gated behind the experimental-features flag; without it
# the choice silently falls back to 20 MHz, which is far too slow to absorb
# a full-rate camera frame and every capture comes back empty.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y

# DMA writes to PSRAM go through L2. The 128 KB / 64-byte-line default turns the
# camera's stream into short bursts; 256 KB with 128-byte lines lets the DMA
# drain in half as many, larger PSRAM transactions.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# 32 MB flash on this board
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# esp_video: MIPI-CSI capture + ISP
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# IMX708 driver + auto-detect
CONFIG_CAMERA_IMX708=y
CONFIG_CAMERA_IMX708_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_IMX219=n

# Autofocus. The VCM is a separate chip (DW9807 at I2C 0x0c) from the sensor,
# so it needs its own driver enabled; CAM_MOTOR_DW9807 selects
# CAMERA_MOTOR_DEVICE_USED, which is what lets the three symbols below turn on.
CONFIG_CAM_MOTOR_DW9807=y
CONFIG_CAM_MOTOR_DW9807_AUTO_DETECT=y
# These three all default to y once a motor driver exists, and are spelled out
# so a future default change cannot quietly leave the lens unmoved - which looks
# like a lens problem, not a config problem. Dropping any one of them gives a
# different failure: without the IPA algorithm nothing decides where to focus,
# without the motor controller esp_video has no way to reach the VCM, and
# without the pipeline control the AF result is computed and then discarded.
CONFIG_ESP_IPA_AF_ALGORITHM=y
CONFIG_ESP_VIDEO_ENABLE_CAMERA_MOTOR_CONTROLLER=y
CONFIG_ESP_VIDEO_ISP_PIPELINE_CONTROL_CAMERA_MOTOR=y

# FAT long filenames on the SD card
CONFIG_FATFS_LFN_HEAP=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
